title GIT提交批处理——未雨初晴
color 02
cls
@echo off
echo *************************************************************
echo *                GIT 代码提交批处理                         
echo *                 Author: 未雨初晴    
echo *************************************************************

echo;
echo 基本信息
echo ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
echo 当前目录是：%cd%
echo;
echo git版本
git --version
echo;


echo Run--- git add -A .
echo ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
git add -A .
echo success add
echo ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
echo;


echo;
echo 提交变更到本地仓库---git commit
echo ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
@echo off
set /p var=请输入提交说明: 
echo 您输入的提交说明为：  %var%
echo;
git commit -m %var%
echo ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

echo;
echo;
echo;
echo 提交到远程git服务器--->git push
echo ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
git push
echo ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
echo 批处理执行完毕！
echo;

pause